load-tests/api-message-load-test.yml
config:
  target: "http://13.82.47.146/api/v1"
  phases:
    - name: Sustained load
      duration: 300
      arrivalRate: 40
      maxVusers: 12000
  ensure:
    thresholds:
      # p99 of response time must be <250ms:
      - "http.response_time.p99": 250
      # p95 of response time must be <200ms:
      - "http.response_time.p95": 200
scenarios:
  - name: "Get Message"
    flow:
    - get:
        url: "/message"