load-tests/api-message-load-test.yml
config:
  target: "http://localhost:9000/api/v1"
  phases:
    - name: Sustained load
      duration: 60
      arrivalRate: 50
      maxVusers: 3000
  ensure:
    thresholds:
      # p99 of response time must be <300ms:
      - "http.response_time.p99": 300
      # p95 of response time must be <250ms:
      - "http.response_time.p95": 250
scenarios:
  - name: "Get Message"
    flow:
    - get:
        url: "/message"